src/main/resources/mockdata/1ab7ef6a-d1d4-4a4f-90a2-882aed18af14.json

{
  "purchase_order": {
    "id": "1ab7ef6a-d1d4-4a4f-90a2-882aed18af14",
    "po_number": "268758",
    "created": "2018-01-10T03:55:00Z",
    "comments": "",
    "total_items": 3,
    "total_estimated_price": 68.00,
    "adjustments": "",
    "assigned_to": "Ann",
    "created_by": "mu44",
    "transmission_date": "",
    "transmission_method": "",
    "po_workflow_status_id": "Open",
    "po_receipt_status": "not received",
    "po_payment_status": ""
  },
  "po_lines": [
    {
      "id": "",
      "acquisition_method": "Email to vendor",
      "barcode": "",
      "cancellation_restriction": false,
      "cancellation_restriction_comment": "",
      "receipt_date": null,
      "collection": false,
      "owner": "LTS Acquisitions",
      "po_line_number": "1",
      "po_line_description": "",
      "adjustment": {
        "id": null,
        "shipment": 0,
        "insurance": 0,
        "discount": 0,
        "overhead": 0,
        "credit": 0,
        "tax_1": 0,
        "tax_2": 0,
        "invoice_id": null,
        "use_pro_rate": false
      },
      "alerts": [
        {
          "id": null,
          "alert": ""
        }
      ],
      "claims": [
        {
          "id": null,
          "claim": true,
          "sent": "2018-09-29T03:00:00Z",
          "grace": 90
        }
      ],
      "cost": {
        "id": null,
        "list_price": 68.00,
        "currency": "USD",
        "quantity": 1,
        "estimated_price": 68.00
      },
      "details": {
        "id": null,
        "title": "Taxes, tributes and tributary lands in the making of Scandinavian kingdoms in the Middle Ages / Steinar Imsen (ed.).",
        "receiving_note": "",
        "product_id": "8251928257",
        "subscription_from": null,
        "material_type": "book",
        "subscription_interval": 0,
        "subscription_to": null,
        "description": ""
      },
      "eresource": {
        "id": null,
        "activation_status": "",
        "activation_due": 1,
        "create_inventory": false,
        "trial": false,
        "expected_activation": null,
        "user_limit": 0,
        "material_id": "",
        "access_provider": null
      },
      "license": "",
      "location": {
        "id": null,
        "quantity": 1,
        "location_id": "Icelandic"
      },
      "order_format": "Physical",
      "order_type": "One-time",
      "physical": {
        "id": null,
        "expected_receipt_date": null,
        "receipt_due": "2018-09-29T03:55:00Z",
        "expected_receipt_interval": 0,
        "volumes": 1,
        "material_id": "",
        "material_supplier": null
      },
      "purchase_order_id": "",
      "receipt_status": "not received",
      "renewal": {
        "id": null,
        "cycle": "",
        "review_period": 0,
        "renewal_date": null,
        "interval": 0,
        "manual_renewal": true
      },
      "source": {
        "id": null,
        "code": "",
        "description": "manual"
      },
      "vendor": {
        "id": "Amazon.com",
        "ref_number": "",
        "ref_no_type": "",
        "instructions": "",
        "vendor_account": "",
        "note_from_vendor": ""
      },
      "workflow_status": "Approved",
      "selector": "Stevens",
      "requester": "",
      "account_number": "",
      "donor": ""
    }
  ]
}
